{
  "structure": [
    {
      "id": "1",
      "question": "Data description and collection or re-use of existing data",
      "subsections": [
        {
          "id": "1.1",
          "question": "How will new data be collected or produced and/or how will existing data be re-used?"
        },
        {
          "id": "1.2",
          "question": "What data (for example the types, formats, and volumes) will be collected or produced?"
        }
      ]
    },
    {
      "id": "2",
      "question": "Documentation and data quality",
      "subsections": [
        {
          "id": "2.1",
          "question": "What metadata and documentation (for example methodology or data collection and way of organising data) will accompany data?"
        },
        {
          "id": "2.2",
          "question": "What data quality control measures will be used?"
        }
      ]
    },
    {
      "id": "3",
      "question": "Storage and backup during the research process",
      "subsections": [
        {
          "id": "3.1",
          "question": "How will data and metadata be stored and backed up during the research process?"
        },
        {
          "id": "3.2",
          "question": "How will data security and protection of sensitive data be taken care of during the research?"
        }
      ]
    },
    {
      "id": "4",
      "question": "Legal requirements, codes of conduct",
      "subsections": [
        {
          "id": "4.1",
          "question": "If personal data are processed, how will compliance with legislation on personal data and on data security be ensured?"
        },
        {
          "id": "4.2",
          "question": "How will other legal issues, such as intellectual property rights and ownership, be managed? What legislation is applicable?"
        }
      ]
    },
    {
      "id": "5",
      "question": "Data sharing and long-term preservation",
      "subsections": [
        {
          "id": "5.1",
          "question": "How and when will data be shared? Are there possible restrictions to data sharing or embargo reasons?"
        },
        {
          "id": "5.2",
          "question": "How will data for preservation be selected, and where will data be preserved long-term (for example a data repository or archive)?"
        },
        {
          "id": "5.3",
          "question": "What methods or software tools will be needed to access and use the data?"
        },
        {
          "id": "5.4",
          "question": "How will the application of a unique and persistent identifier (such as a Digital Object Identifier (DOI)) to each data set be ensured?"
        }
      ]
    },
    {
      "id": "6",
      "question": "Data management responsibilities and resources",
      "subsections": [
        {
          "id": "6.1",
          "question": "Who (for example role, position, and institution) will be responsible for data management (i.e the data steward)?"
        },
        {
          "id": "6.2",
          "question": "What resources (for example financial and time) will be dedicated to data management and ensuring the data will be FAIR (Findable, Accessible, Interoperable, Re-usable)?"
        }
      ]
    }
  ]
}