{
  "1.1": [
    "Instead of \"research data\" specify concrete types: \"survey data (200 respondents, approx. 100 MB)\", \"microscopic images (50-100 photos, approx. 500 MB)\", \"spectroscopic measurement results (series of 5 GB)\", \"interviews (20 recordings of 60-90 min, approx. 10 GB audio)\". What is the estimated total size of all collected data (e.g. up to 1 TB or between 100 and 500 GB)?",
    "Add the data collection methodology: \"Data collected via online surveys in LimeSurvey\", \"Measurements performed with Raman spectrometer\", \"Interviews with semi-structured questionnaire\", \"Data generated by simulations in MATLAB\"."
  ],
  "1.2": [
    "Specify concrete file extensions: \".csv, .txt, .jpg\" or \"files .xlsx (tables), .pdf (reports), .png (charts)\" with approximate size: \".csv up to 5 MB each\", \".jpg approx. 20 MB each\". Formats can be divided into two types: specific to laboratory software and commonly used text, tabular and graphical formats.",
    "Recommended open formats: .csv instead of .xlsx, .txt, .json, .xml, .png, .tiff, .odt. If proprietary format is necessary: save the final version also in open format. Data intended for deposit in a repository should be saved in open formats, if this does not lead to loss of information."
  ],
  "2.1": [
    "Dataset requires: (1) README.txt with variable descriptions, units, methodology, file structure, authors, date, limitations, software. (2) Metadata generated by the MOST Wiedzy Open Research Data Catalog (Bridge of Data) repository according to the DataCite standard, stored in JSON-LD format.",
    "How will data be organized during the project? Will there be a folder structure or special software? Will data be organized by file type or research stage? Will names be generated automatically or according to a defined schema?",
    "Describe the organization: \"Table: rows=participants, columns=variables (age, gender, results)\" or \"Folders: /raw_data, /processed_data, /scripts, /results, /documentation\". Collected files should have systematic names that allow for quick identification of content."
  ],
  "2.2": [
    "Instead of \"high-quality data\" specify concrete procedures: \"Double data entry by two independent persons\", \"Equipment calibration monthly according to manufacturer protocols\", \"Automated validation of value ranges\", \"Maintaining laboratory notebooks in paper and digital versions\"."
  ],
  "3.1": [
    "How often will backups be created? The 3-2-1 strategy: 3 copies of data, 2 different media, 1 copy off-site. Example: computer disk + OneDrive (automatically daily) + external disk (manually weekly, stored at a different location)."
  ],
  "4.1": [
    "Research with humans: check regulations whether ethics committee approval is needed. If yes: provide approval number. If no: justify why it is not required (e.g. study does not require approval under institutional regulations, anonymous questionnaires without personal data).",
    "Personal data: first name, surname, national ID number, email, address. Sensitive data (special categories): health, sexual orientation, religious beliefs, ethnic origin, genetic data. If the project collects personal data: detailed description of GDPR compliance (legal basis, informing participants, retention period, anonymization, data subject rights)."
  ],
  "5.1": [
    "CC BY - requires attribution (standard for NCN). CC0 - waiver of copyright, public domain. Note: CC0 may conflict with the Intellectual Property Regulations of the institution (rights belong to the university). Before choosing CC0: consult the legal department.",
    "Embargo is justified when: analysis in progress and publication preparation, planned further publications, obligations to collaborators, patent process. Max 2 years from the end of the NCN project. Specific justification and specific end date required (\"31.12.2026\", not \"after project completion\").",
    "By sharing we mean depositing data in a repository and enabling download by all interested parties. The data sharing date should be correlated with the process of publishing research results."
  ],
  "5.2": [
    "Specify in which repository the data will be stored. If the name is not provided, define selection criteria: a repository dedicated to research data that provides data according to FAIR principles and meets the funder's requirements."
  ]
}
