{
     "standard_sentences": {
          "piotr_krajewski_standards": [
               "Data will be stored using the institutional Office 365 A1 for faculty license, providing OneDrive cloud storage with automatic versioning and EU data residency compliance.",
               "The only additional resource required is time for FAIR procedures assessment and data quality assurance.",
               "The Principal Investigator will ensure FAIR principles implementation by describing, structuring, and preparing data for publication.",
               "DOIs will be automatically assigned upon deposit in MOST Wiedzy repository.",
               "Data will be shared under Creative Commons Attribution 4.0 International (CC BY 4.0) license, allowing any use with attribution."
          ],
          "approval_phrases": [
               "Plan jest bardzo dobry, należy tylko dodać kilka informacji.",
               "Plan w kontekście charakteru Pańskich badań jest naprawdę bardzo dobry.",
               "To są drobne szczegóły, plan jest świetny.",
               "Plan jest zatwierdzony, prosiłbym tylko o podesłanie ostatecznej wersji do naszej ewidencji.",
               "The plan is very good, only minor details need adjustment."
          ],
          "repository_statements": [
               "MOST Wiedzy Open Research Data Catalog (Bridge of Data) is Gdańsk University of Technology's institutional repository, which is CoreTrustSeal certified, ensuring compliance with international standards for trustworthy data repositories.",
               "Data will be deposited in MOST Wiedzy Open Research Data Catalog, which provides automatic DOI assignment, standardized metadata using DataCite schema, and guarantees minimum 10-year preservation period.",
               "As alternative to MOST Wiedzy, discipline-specific repositories may be used: Zenodo for general scientific data, GenBank for genetic sequences, PDB for protein structures, or other recognized domain repositories."
          ]
     }
}